templates/test.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body><GetListItemChangesSinceToken xmlns="http://schemas.microsoft.com/sharepoint/soap/"><listName>{1a2650ed-db30-4337-b137-8e5771a08443}</listName><viewFields><ViewFields Properties="TRUE"><FieldRef Name="ID"/><FieldRef Name="ReplicationID"/><FieldRef Name="Attachments"/><FieldRef Name="owshiddenversion"/><FieldRef Name="Created"/><FieldRef Name="Modified"/><FieldRef Name="vti_versionhistory"/><FieldRef Name="ContentTypeId"/><FieldRef Name="EventType"/><FieldRef Name="Title"/><FieldRef Name="HeaderInfo"/><FieldRef Name="FooterInfo"/><FieldRef Name="UID"/><FieldRef Name="Description"/><FieldRef Name="Location"/><FieldRef Name="EventDate"/><FieldRef Name="EndDate"/><FieldRef Name="fAllDayEvent"/><FieldRef Name="Duration"/><FieldRef Name="XMLTZone"/><FieldRef Name="RecurrenceData"/><FieldRef Name="RecurrenceID"/><FieldRef Name="fRecurrence"/><FieldRef Name="FollowUp"/><FieldRef Name="Priority"/><FieldRef Name="IntendedBusyStatus"/><FieldRef Name="BusyStatus"/><FieldRef Name="Categories"/><FieldRef Name="Editor"/><FieldRef Name="TimeZone"/><FieldRef Name="MetaInfo"/><FieldRef Name="PermMask"/></ViewFields></viewFields><queryOptions><QueryOptions><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ViewAttributes Scope="RecursiveAll"/><DateInUtc>TRUE</DateInUtc><IncludePermissions>FALSE</IncludePermissions><IncludeAttachmentUrls>TRUE</IncludeAttachmentUrls><IncludeAttachmentVersion>TRUE</IncludeAttachmentVersion><ExpandUserField>TRUE</ExpandUserField><MeetingInstanceID>-1</MeetingInstanceID><OptimizeLookups>TRUE</OptimizeLookups></QueryOptions></queryOptions><changeToken>1;3;1a2650ed-db30-4337-b137-8e5771a08443;635582327934430000;12976</changeToken></GetListItemChangesSinceToken></Body></Envelope>